Alex2269/stm32_lvgl/stm32f407/tft_ll/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_pwr.h"
#include "stm32f4xx_ll_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TOUCH_PEN_Pin LL_GPIO_PIN_2
#define TOUCH_PEN_GPIO_Port GPIOE
#define LED2_Pin LL_GPIO_PIN_6
#define LED2_GPIO_Port GPIOA
#define LED3_Pin LL_GPIO_PIN_7
#define LED3_GPIO_Port GPIOA
#define LCD_RST_Pin LL_GPIO_PIN_5
#define LCD_RST_GPIO_Port GPIOC
#define LCD_BL_Pin LL_GPIO_PIN_0
#define LCD_BL_GPIO_Port GPIOB
#define TOUCH_CLK_Pin LL_GPIO_PIN_1
#define TOUCH_CLK_GPIO_Port GPIOB
#define TOUCH_CS_Pin LL_GPIO_PIN_2
#define TOUCH_CS_GPIO_Port GPIOB
#define TOUCH_MISO_Pin LL_GPIO_PIN_0
#define TOUCH_MISO_GPIO_Port GPIOE
#define TOUCH_MOSI_Pin LL_GPIO_PIN_1
#define TOUCH_MOSI_GPIO_Port GPIOE
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
